#### 📖 Terraform Plan ('infra/resources/prod') - failure
<details>
<summary>Terraform Plan</summary>

```hcl
data.azurerm_linux_web_app.app_backend_li: Still reading... [10s elapsed]
data.azurerm_linux_web_app.app_backend_li: Still reading... [20s elapsed]
Error: Error in function call

  on function_profile.tf line 29, in locals:
  29:       COSMOSDB_CONNECTION_STRING = format("AccountEndpoint=%s;AccountKey=%s;", data.azurerm_cosmosdb_account.cosmos_api.endpoint, data.azurerm_cosmosdb_account.cosmos_api.primary_key)
    ├────────────────
    │ while calling format(format, args...)
    │ data.azurerm_cosmosdb_account.cosmos_api.endpoint is "https://io-p-cosmos-api.documents.azure.com:443/"

Call to function "format" failed: unsupported value for "%s" at 30: null
value cannot be formatted.

Error: Error in function call

  on kv_secrets.tf line 48, in resource "azurerm_key_vault_secret" "cosmos_api_connection_string":
  48:   value        = format("AccountEndpoint=%s;AccountKey=%s;", data.azurerm_cosmosdb_account.cosmos_api.endpoint, data.azurerm_cosmosdb_account.cosmos_api.primary_key)
    ├────────────────
    │ while calling format(format, args...)
    │ data.azurerm_cosmosdb_account.cosmos_api.endpoint is "https://io-p-cosmos-api.documents.azure.com:443/"

Call to function "format" failed: unsupported value for "%s" at 30: null
value cannot be formatted.
-itn-auth-webprof-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnauthwebprofstfn01/providers/Microsoft.Authorization/roleAssignments/c08da5ef-d91a-78ca-fd3e-156cf8778d08]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # azurerm_resource_group.auth_common_rg will be updated in-place
  ~ resource "azurerm_resource_group" "auth_common_rg" {
        id         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-common-rg-01"
        name       = "io-p-itn-auth-common-rg-01"
      ~ tags       = {
          - "BusinessUnit"   = "App IO" -> null
          ~ "CostCenter"     = "TS000 - Tecnologia e Servizi" -> "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
          ~ "ManagementTeam" = "IO Autenticazione" -> "IO Auth&Identity"
          + "Owner"          = "IO"
          ~ "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/blob/main/infra/bootstrapper" -> "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (2 unchanged attributes hidden)
    }

  # azurerm_resource_group.function_lollipop_rg will be updated in-place
  ~ resource "azurerm_resource_group" "function_lollipop_rg" {
        id         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02"
        name       = "io-p-itn-auth-lollipop-rg-02"
      ~ tags       = {
          - "BusinessUnit"   = "App IO" -> null
          ~ "CostCenter"     = "TS000 - Tecnologia e Servizi" -> "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
          ~ "ManagementTeam" = "IO Autenticazione" -> "IO Auth&Identity"
          + "Owner"          = "IO"
          ~ "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/blob/main/infra/bootstrapper" -> "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (2 unchanged attributes hidden)
    }

  # azurerm_resource_group.function_lv_rg will be updated in-place
  ~ resource "azurerm_resource_group" "function_lv_rg" {
        id         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lv-rg-01"
        name       = "io-p-itn-auth-lv-rg-01"
      ~ tags       = {
          - "BusinessUnit"   = "App IO" -> null
          ~ "CostCenter"     = "TS000 - Tecnologia e Servizi" -> "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
          ~ "ManagementTeam" = "IO Autenticazione" -> "IO Auth&Identity"
          + "Owner"          = "IO"
          ~ "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/blob/main/infra/bootstrapper" -> "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (2 unchanged attributes hidden)
    }

  # azurerm_resource_group.function_public_rg will be updated in-place
  ~ resource "azurerm_resource_group" "function_public_rg" {
        id         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-public-rg-01"
        name       = "io-p-itn-auth-public-rg-01"
      ~ tags       = {
          - "BusinessUnit"   = "App IO" -> null
          ~ "CostCenter"     = "TS000 - Tecnologia e Servizi" -> "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
          ~ "ManagementTeam" = "IO Autenticazione" -> "IO Auth&Identity"
          + "Owner"          = "IO"
          ~ "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/blob/main/infra/bootstrapper" -> "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (2 unchanged attributes hidden)
    }

  # azurerm_resource_group.function_web_profile_rg will be updated in-place
  ~ resource "azurerm_resource_group" "function_web_profile_rg" {
        id         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-webprof-rg-01"
        name       = "io-p-itn-auth-webprof-rg-01"
      ~ tags       = {
          - "BusinessUnit"   = "App IO" -> null
          ~ "CostCenter"     = "TS000 - Tecnologia e Servizi" -> "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
          ~ "ManagementTeam" = "IO Autenticazione" -> "IO Auth&Identity"
          + "Owner"          = "IO"
          ~ "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/blob/main/infra/bootstrapper" -> "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (2 unchanged attributes hidden)
    }

  # azurerm_resource_group.main_resource_group will be updated in-place
  ~ resource "azurerm_resource_group" "main_resource_group" {
        id         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01"
        name       = "io-p-itn-auth-main-rg-01"
      ~ tags       = {
          - "BusinessUnit"   = "App IO" -> null
          ~ "CostCenter"     = "TS000 - Tecnologia e Servizi" -> "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
          ~ "ManagementTeam" = "IO Autenticazione" -> "IO Auth&Identity"
          + "Owner"          = "IO"
          ~ "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/blob/main/infra/bootstrapper" -> "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (2 unchanged attributes hidden)
    }

  # azurerm_resource_group.rg_elt will be updated in-place
  ~ resource "azurerm_resource_group" "rg_elt" {
        id         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-elt-rg-01"
        name       = "io-p-itn-auth-elt-rg-01"
      ~ tags       = {
          - "BusinessUnit"   = "App IO" -> null
          ~ "CostCenter"     = "TS000 - Tecnologia e Servizi" -> "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
          ~ "ManagementTeam" = "IO Autenticazione" -> "IO Auth&Identity"
          + "Owner"          = "IO"
          ~ "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/blob/main/infra/bootstrapper" -> "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (2 unchanged attributes hidden)
    }

  # azurerm_resource_group.shared_rg will be updated in-place
  ~ resource "azurerm_resource_group" "shared_rg" {
        id         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-citizen-auth-shared-rg-01"
        name       = "io-p-itn-citizen-auth-shared-rg-01"
      ~ tags       = {
          - "BusinessUnit"   = "App IO" -> null
          - "CostCenter"     = "TS000 - Tecnologia e Servizi" -> null
          - "CreatedBy"      = "Terraform" -> null
          - "Environment"    = "Prod" -> null
          - "ManagementTeam" = "IO Autenticazione" -> null
          - "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/blob/main/infra/bootstrapper" -> null
        }
        # (2 unchanged attributes hidden)
    }

  # module.function_lollipop_autoscale.data.azurerm_linux_function_app.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_linux_function_app" "this" {
      + app_settings                                   = (known after apply)
      + auth_settings                                  = (known after apply)
      + auth_settings_v2                               = (known after apply)
      + availability                                   = (known after apply)
      + backup                                         = (known after apply)
      + builtin_logging_enabled                        = (known after apply)
      + client_certificate_enabled                     = (known after apply)
      + client_certificate_exclusion_paths             = (known after apply)
      + client_certificate_mode                        = (known after apply)
      + connection_string                              = (known after apply)
      + content_share_force_disabled                   = (known after apply)
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = (known after apply)
      + default_hostname                               = (known after apply)
      + enabled                                        = (known after apply)
      + ftp_publish_basic_authentication_enabled       = (known after apply)
      + functions_extension_version                    = (known after apply)
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = (known after apply)
      + id                                             = (known after apply)
      + identity                                       = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = (known after apply)
      + name                                           = "io-p-itn-auth-lollipop-func-02"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = (known after apply)
      + resource_group_name                            = "io-p-itn-auth-lollipop-rg-02"
      + service_plan_id                                = (known after apply)
      + site_config                                    = (known after apply)
      + site_credential                                = (sensitive value)
      + sticky_settings                                = (known after apply)
      + storage_account_access_key                     = (sensitive value)
      + storage_account_name                           = (known after apply)
      + storage_key_vault_secret_id                    = (known after apply)
      + storage_uses_managed_identity                  = (known after apply)
      + tags                                           = (known after apply)
      + usage                                          = (known after apply)
      + virtual_network_subnet_id                      = (known after apply)
      + webdeploy_publish_basic_authentication_enabled = (known after apply)
    }

  # module.function_lollipop_autoscale.azurerm_monitor_autoscale_setting.this must be replaced
-/+ resource "azurerm_monitor_autoscale_setting" "this" {
      ~ id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Insights/autoScaleSettings/io-p-itn-auth-lollipop-as-02" -> (known after apply)
      ~ location            = "italynorth" -> (known after apply) # forces replacement
        name                = "io-p-itn-auth-lollipop-as-02"
        tags                = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Auth&Identity"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      ~ target_resource_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/serverfarms/io-p-itn-auth-lollipop-asp-02" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)

      ~ profile {
            name = "evening"

          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/sites/io-p-itn-auth-lollipop-func-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/sites/io-p-itn-auth-lollipop-func-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/serverfarms/io-p-itn-auth-lollipop-asp-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/serverfarms/io-p-itn-auth-lollipop-asp-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }
      ~ profile {
            name = jsonencode(
                {
                    for  = "evening"
                    name = "default"
                }
            )

          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/sites/io-p-itn-auth-lollipop-func-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/sites/io-p-itn-auth-lollipop-func-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/serverfarms/io-p-itn-auth-lollipop-asp-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/serverfarms/io-p-itn-auth-lollipop-asp-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.function_lv_autoscale.data.azurerm_linux_function_app.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_linux_function_app" "this" {
      + app_settings                                   = (known after apply)
      + auth_settings                                  = (known after apply)
      + auth_settings_v2                               = (known after apply)
      + availability                                   = (known after apply)
      + backup                                         = (known after apply)
      + builtin_logging_enabled                        = (known after apply)
      + client_certificate_enabled                     = (known after apply)
      + client_certificate_exclusion_paths             = (known after apply)
      + client_certificate_mode                        = (known after apply)
      + connection_string                              = (known after apply)
      + content_share_force_disabled                   = (known after apply)
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = (known after apply)
      + default_hostname                               = (known after apply)
      + enabled                                        = (known after apply)
      + ftp_publish_basic_authentication_enabled       = (known after apply)
      + functions_extension_version                    = (known after apply)
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = (known after apply)
      + id                                             = (known after apply)
      + identity                                       = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = (known after apply)
      + name                                           = "io-p-itn-auth-lv-func-02"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = (known after apply)
      + resource_group_name                            = "io-p-itn-auth-lv-rg-01"
      + service_plan_id                                = (known after apply)
      + site_config                                    = (known after apply)
      + site_credential                                = (sensitive value)
      + sticky_settings                                = (known after apply)
      + storage_account_access_key                     = (sensitive value)
      + storage_account_name                           = (known after apply)
      + storage_key_vault_secret_id                    = (known after apply)
      + storage_uses_managed_identity                  = (known after apply)
      + tags                                           = (known after apply)
      + usage                                          = (known after apply)
      + virtual_network_subnet_id                      = (known after apply)
      + webdeploy_publish_basic_authentication_enabled = (known after apply)
    }

  # module.function_lv_autoscale.azurerm_monitor_autoscale_setting.this must be replaced
-/+ resource "azurerm_monitor_autoscale_setting" "this" {
      ~ id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lv-rg-01/providers/Microsoft.Insights/autoScaleSettings/io-p-itn-auth-lv-as-02" -> (known after apply)
      ~ location            = "italynorth" -> (known after apply) # forces replacement
        name                = "io-p-itn-auth-lv-as-02"
        tags                = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Auth&Identity"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      ~ target_resource_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lv-rg-01/providers/Microsoft.Web/serverfarms/io-p-itn-auth-lv-asp-02" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)

      ~ profile {
            name = "evening"

          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lv-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-lv-func-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lv-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-lv-func-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lv-rg-01/providers/Microsoft.Web/serverfarms/io-p-itn-auth-lv-asp-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lv-rg-01/providers/Microsoft.Web/serverfarms/io-p-itn-auth-lv-asp-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }
      ~ profile {
            name = jsonencode(
                {
                    for  = "evening"
                    name = "default"
                }
            )

          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lv-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-lv-func-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lv-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-lv-func-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lv-rg-01/providers/Microsoft.Web/serverfarms/io-p-itn-auth-lv-asp-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lv-rg-01/providers/Microsoft.Web/serverfarms/io-p-itn-auth-lv-asp-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.function_public.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          - "COSMOSDB_KEY"                                                                                     = (sensitive value) -> null
            # (26 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-public-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-public-func-02"
        name                                           = "io-p-itn-auth-public-func-02"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
            "ModuleVersion"                                  = "0.3.1"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_public.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          - "COSMOSDB_KEY"                                                                                     = (sensitive value) -> null
            # (27 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-public-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-public-func-02/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
            "ModuleVersion"                                  = "0.3.1"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (29 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_session_manager_internal_autoscale.data.azurerm_linux_function_app.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_linux_function_app" "this" {
      + app_settings                                   = (known after apply)
      + auth_settings                                  = (known after apply)
      + auth_settings_v2                               = (known after apply)
      + availability                                   = (known after apply)
      + backup                                         = (known after apply)
      + builtin_logging_enabled                        = (known after apply)
      + client_certificate_enabled                     = (known after apply)
      + client_certificate_exclusion_paths             = (known after apply)
      + client_certificate_mode                        = (known after apply)
      + connection_string                              = (known after apply)
      + content_share_force_disabled                   = (known after apply)
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = (known after apply)
      + default_hostname                               = (known after apply)
      + enabled                                        = (known after apply)
      + ftp_publish_basic_authentication_enabled       = (known after apply)
      + functions_extension_version                    = (known after apply)
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = (known after apply)
      + id                                             = (known after apply)
      + identity                                       = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = (known after apply)
      + name                                           = "io-p-weu-auth-sm-int-func-01"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = (known after apply)
      + resource_group_name                            = "io-p-itn-auth-main-rg-01"
      + service_plan_id                                = (known after apply)
      + site_config                                    = (known after apply)
      + site_credential                                = (sensitive value)
      + sticky_settings                                = (known after apply)
      + storage_account_access_key                     = (sensitive value)
      + storage_account_name                           = (known after apply)
      + storage_key_vault_secret_id                    = (known after apply)
      + storage_uses_managed_identity                  = (known after apply)
      + tags                                           = (known after apply)
      + usage                                          = (known after apply)
      + virtual_network_subnet_id                      = (known after apply)
      + webdeploy_publish_basic_authentication_enabled = (known after apply)
    }

  # module.function_session_manager_internal_autoscale.azurerm_monitor_autoscale_setting.this must be replaced
-/+ resource "azurerm_monitor_autoscale_setting" "this" {
      ~ id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Insights/autoScaleSettings/io-p-weu-auth-sm-int-as-01" -> (known after apply)
      ~ location            = "westeurope" -> (known after apply) # forces replacement
        name                = "io-p-weu-auth-sm-int-as-01"
        tags                = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Auth&Identity"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      ~ target_resource_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/serverfarms/io-p-weu-auth-sm-int-asp-01" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)

      ~ profile {
            name = "Default"

          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/sites/io-p-weu-auth-sm-int-func-01" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/sites/io-p-weu-auth-sm-int-func-01" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/serverfarms/io-p-weu-auth-sm-int-asp-01" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/serverfarms/io-p-weu-auth-sm-int-asp-01" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }

            # (1 unchanged block hidden)
        }
    }

Plan: 3 to add, 10 to change, 3 to destroy.
::error::Terraform exited with code 1.
```

</details>
